* Utils

#+BEGIN_SRC sh 
sudo apt-get install silversearcher-ag
sudo apt-get install aspell-it
sudo apt-get install pandoc
sudo apt-get install aha
#+END_SRC

* Nodejs

#+BEGIN_SRC sh 
sudo apt-get purge nodejs && sudo apt-get autoremove && sudo apt-get autoclean
curl -o- https://raw.githubusercontent.com/creationix/nvm/v0.33.0/install.sh | bash
nvm install 6.9.5
nvm use 6.9.5
nvm alias default 6.9.5
#+END_SRC

* Powerline Fonts
git clone https://github.com/powerline/fonts.git
# cd fonts && ./install.sh

* Tex/Latex with Texlive

#+BEGIN_SRC shell 
sudo add-apt-repository ppa:jonathonf/texlive
sudo apt-get install texlive-full
# sudo apt-get install texlive-luatex
# sudo apt-get install perl-tk
# sudo apt-get install xzdec

tlmgr init-usertree
tlmgr gui # --> then install packages
#+END_SRC

* Screen setup

#+BEGIN_SRC shell
xrandr --listmonitors
#+END_SRC

#+RESULTS:
| Monitors: |       1 |                       |       |
|        0: | +*HDMI1 | 1920/518x1200/324+0+0 | HDMI1 |


#+BEGIN_SRC sh 
xrandr --output HDMI1 --gamma 0.9:0.9:0.9 --brightness 1
#+END_SRC

#+RESULTS:



